In [3]:
import pandas as pd

In [8]:
data = pd.read_csv(r'C:\Users\nihar\Desktop\live_class\US_Visa_approval_prediction\Visadataset.csv')
data_dict = data.to_dict(orient='records')

In [17]:
DB_NAME = "US_VISA"
COLLECTION_NAME = "visa_data"
CONNECTION_URL = 'mongodb+srv://sahooniharranjan41:nihar1234@cluster0.zq9xzn0.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0'

In [18]:
import pymongo

In [19]:
client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]
rec = collection.insert_many(data_dict)

In [20]:
df = pd.DataFrame(list(collection.find()))

In [21]:
df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,65d8bbfd4485d71d0c6e998a,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,65d8bbfd4485d71d0c6e998b,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,65d8bbfd4485d71d0c6e998c,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,65d8bbfd4485d71d0c6e998d,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,65d8bbfd4485d71d0c6e998e,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified